-- -*- M2-comint -*- {* hash: -1001222782 *}
--loading configuration for package "Bertini" from file /Users/Ro/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R = CC[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : F = {(y^2+x^2+z^2-1)*x,(y^2+x^2+z^2-1)*y}

       3      2      2       2     3      2
o2 = {x  + x*y  + x*z  - x, x y + y  + y*z  - y}

o2 : List

i3 : NV = bertiniPosDimSolve(F)
Temporary directory for input and output files:/var/folders/ty/zc3ztkx12z16c1x9b89s_97c0000gn/T/M2-44351-0/0

The version of Bertini you have installed on your computer was used for this run. 
Bertini is under ongoing development by D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o3 = A variety of dimension 2 with components in
     dim 1:  [dim=1,deg=1]
     dim 2:  [dim=2,deg=2]

o3 : NumericalVariety

i4 : pts = {{0,0,0}} --z-axis

o4 = {{0, 0, 0}}

o4 : List

i5 : bertiniComponentMemberTest(NV,pts)
Temporary directory for input and output files:/var/folders/ty/zc3ztkx12z16c1x9b89s_97c0000gn/T/M2-44351-0/1

The version of Bertini you have installed on your computer was used for this run. 
Bertini is under ongoing development by D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o5 = {{[dim=1,deg=1]}}

o5 : List

i6 : 
